#### PANDAS 
Used for data analysis, data cleaning. Provides two datastructures series and dataframe.

In [12]:
import pandas as pd
import numpy as np

In [6]:
# Pandas Series - One dimensional array-like object that can hold any datatype
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print(f'Series\n{series}')
print(type(series))

Series
0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
# Series from a dictionary
data = {'a':1, 'b': 2, 'c':3} # Keys become indexes and values become values
dict_series = pd.Series(data)
print(dict_series)

a    1
b    2
c    3
dtype: int64

In [9]:
data = [10, 50, 100]
index = ['x', 'y', 'z']
print(pd.Series(data, index))

x     10
y     50
z    100
dtype: int64

In [14]:
# Dataframe
data = {
  'Name': ['Hardik', 'Virat', 'Rohit'],
  'Age': [30, 37, 38],
  'State': ['Gujarat', 'Delhi', 'Mumbai']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age    State
0  Hardik   30  Gujarat
1   Virat   37    Delhi
2   Rohit   38   Mumbai
<class 'pandas.core.frame.DataFrame'>

In [15]:
print(np.array(data))

{'Name': ['Hardik', 'Virat', 'Rohit'], 'Age': [30, 37, 38], 'State': ['Gujarat', 'Delhi', 'Mumbai']}

In [17]:
# Creating a df from a list of dictionaries
data = [
  {'Name': 'Bumrah', 'Age': 30, 'Team': 'Mumbai'},
  {'Name': 'Jitesh', 'Age': 32, 'Team': 'Bangalore'},
  {'Name': 'Arshdeep', 'Age':26 ,'Team': 'Punjab'},
]
df = pd.DataFrame(data)
print(df)

       Name  Age       Team
0    Bumrah   30     Mumbai
1    Jitesh   32  Bangalore
2  Arshdeep   26     Punjab

In [20]:
# Reading a csv file
df = pd.read_csv('heart.csv')
df.head(5)

,Age,Sex,ChestPainType,RestingBP,Cholesterol,FastingBS,RestingECG,MaxHR,ExerciseAngina,Oldpeak,ST_Slope,HeartDisease
0,40,M,ATA,140,289,0,Normal,172,N,0.0,Up,0
1,49,F,NAP,160,180,0,Normal,156,N,1.0,Flat,1
2,37,M,ATA,130,283,0,ST,98,N,0.0,Up,0
3,48,F,ASY,138,214,0,Normal,108,Y,1.5,Flat,1
4,54,M,NAP,150,195,0,Normal,122,N,0.0,Up,0

In [21]:
df.tail()

,Age,Sex,ChestPainType,RestingBP,Cholesterol,FastingBS,RestingECG,MaxHR,ExerciseAngina,Oldpeak,ST_Slope,HeartDisease
913,45,M,TA,110,264,0,Normal,132,N,1.2,Flat,1
914,68,M,ASY,144,193,1,Normal,141,N,3.4,Flat,1
915,57,M,ASY,130,131,0,Normal,115,Y,1.2,Flat,1
916,57,F,ATA,130,236,0,LVH,174,N,0.0,Flat,1
917,38,M,NAP,138,175,0,Normal,173,N,0.0,Up,0

In [31]:
# Accessing data from a dataframe
data = {
  'Name': ['Hardik', 'Virat', 'Rohit'],
  'Age': [30, 37, 38],
  'State': ['Gujarat', 'Delhi', 'Mumbai']
}

df = pd.DataFrame(data)
df

     Name  Age    State
0  Hardik   30  Gujarat
1   Virat   37    Delhi
2   Rohit   38   Mumbai

In [32]:
df['Name']

0    Hardik
1     Virat
2     Rohit
Name: Name, dtype: object

In [33]:
df.loc[0]

Name      Hardik
Age           30
State    Gujarat
Name: 0, dtype: object

In [37]:
df.at[1, 'Name']

'Virat'

In [40]:
df.at[0, 'Age']

np.int64(30)

In [46]:
# Accessing specified element using iat
print(df.iat[2, 0])
print(df.iat[0, 2])

df

Rohit
Gujarat

     Name  Age    State
0  Hardik   30  Gujarat
1   Virat   37    Delhi
2   Rohit   38   Mumbai

In [60]:
# Data manipulation with dataframes
# Adding a new column
df['Played_for'] = [8, 18, 17]
df

df.drop('Played_for', axis=1)

     Name  Age    State  Played_for(in Years)
0  Hardik   30  Gujarat                     8
1   Virat   37    Delhi                    18
2   Rohit   38   Mumbai                    17

In [61]:
df

     Name  Age    State  Played_for(in Years)  Played_for
0  Hardik   30  Gujarat                     8           8
1   Virat   37    Delhi                    18          18
2   Rohit   38   Mumbai                    17          17

In [62]:
df.drop('Played_for', axis=1, inplace=True)

In [58]:
df

     Name  Age    State  Played_for(in Years)
0  Hardik   30  Gujarat                     8
1   Virat   37    Delhi                    18
2   Rohit   38   Mumbai                    17

In [63]:
df['Age'] = df['Age']+1
df

     Name  Age    State  Played_for(in Years)
0  Hardik   31  Gujarat                     8
1   Virat   38    Delhi                    18
2   Rohit   39   Mumbai                    17

In [65]:
df.drop(0, inplace=True)

In [66]:
df

    Name  Age   State  Played_for(in Years)
1  Virat   38   Delhi                    18
2  Rohit   39  Mumbai                    17

In [68]:
df = pd.read_csv('heart.csv')
df.head()

,Age,Sex,ChestPainType,RestingBP,Cholesterol,FastingBS,RestingECG,MaxHR,ExerciseAngina,Oldpeak,ST_Slope,HeartDisease
0,40,M,ATA,140,289,0,Normal,172,N,0.0,Up,0
1,49,F,NAP,160,180,0,Normal,156,N,1.0,Flat,1
2,37,M,ATA,130,283,0,ST,98,N,0.0,Up,0
3,48,F,ASY,138,214,0,Normal,108,Y,1.5,Flat,1
4,54,M,NAP,150,195,0,Normal,122,N,0.0,Up,0

In [69]:
df.describe()

,Age,RestingBP,Cholesterol,FastingBS,MaxHR,Oldpeak,HeartDisease
count,918.000000,918.000000,918.000000,918.000000,918.000000,918.000000,918.000000
mean,53.510893,132.396514,198.799564,0.233115,136.809368,0.887364,0.553377
std,9.432617,18.514154,109.384145,0.423046,25.460334,1.066570,0.497414
min,28.000000,0.000000,0.000000,0.000000,60.000000,-2.600000,0.000000
25%,47.000000,120.000000,173.250000,0.000000,120.000000,0.000000,0.000000
50%,54.000000,130.000000,223.000000,0.000000,138.000000,0.600000,1.000000
75%,60.000000,140.000000,267.000000,0.000000,156.000000,1.500000,1.000000
max,77.000000,200.000000,603.000000,1.000000,202.000000,6.200000,1.000000

In [76]:
# Displaying datatypes of each column
print(f'Data Types:\n {df.dtypes}')

# Groupby a column and perform aggregation
grouped = df.groupby('Sex')['RestingBP'].mean()
print('Mean restingBP by Sex\n',grouped)

Data Types:
 Age                 int64
Sex                object
ChestPainType      object
RestingBP           int64
Cholesterol         int64
FastingBS           int64
RestingECG         object
MaxHR               int64
ExerciseAngina     object
Oldpeak           float64
ST_Slope           object
HeartDisease        int64
dtype: object
Mean restingBP by Sex
 Sex
F    132.212435
M    132.445517
Name: RestingBP, dtype: float64